# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

numb = int(input("Ведите трехзначное число: "))
summ = 0
if numb < 1000:
    while numb > 0:
        summ += numb % 10
        numb //= 10
    print("Сумма: ", summ)
else:
    print("Число не трехзначное")
